flashsim_result/sysbench/ctoc/complex_t60.out
018. 12. 17. (월) 02:39:27 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            672448
        write:                           240150
        other:                           96061
        total:                           1008659
    transactions:                        48029  (799.52 per sec.)
    deadlocks:                           3      (0.05 per sec.)
    read/write requests:                 912598 (15191.64 per sec.)
    other operations:                    96061  (1599.09 per sec.)

Test execution summary:
    total time:                          60.0724s
    total number of events:              48029
    total time taken by event execution: 960.1999
    per-request statistics:
         min:                                  7.63ms
         avg:                                 19.99ms
         max:                                212.41ms
         approx.  95 percentile:              34.33ms

Threads fairness:
    events (avg/stddev):           3001.8125/3.59
    execution time (avg/stddev):   60.0125/0.02

2018. 12. 17. (월) 02:40:27 KST

-------------------------------------------------------------------------

mutex_t : 0x573fea8 q:0x573fea0, size:2048
mutex_t : 0x5740478 q:0x5740470, size:1024
mutex_t : 0x57404d8 q:0x57404d0, size:1024
mutex_t : 0x5740538 q:0x5740530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 9733 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = 316335191, gearRec = -2141387109, aurSend = -608748342, aurRec = -1996130103, readSend=-1753861166, writeSend=-1054223938
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x5760378 q:0x5760370, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!

WAF: 1.08

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07

WAF: 1.07
^C


[cdf]read---
60	1	0.000000
70	2	0.000001
120	1274	0.000507
130	27458	0.011409
140	84915	0.045123
150	86810	0.079590
160	70076	0.107413
170	88908	0.142712
180	105994	0.184796
190	103848	0.226027
200	89880	0.261713
210	77879	0.292634
220	73904	0.321976
230	73802	0.351279
240	68762	0.378580
250	62136	0.403250
260	52654	0.424155
270	49668	0.443875
280	53140	0.464974
290	61283	0.489306
300	68900	0.516661
310	70485	0.544647
320	68726	0.571933
330	67666	0.598799
340	71756	0.627289
350	75078	0.657098
360	73978	0.686470
370	69289	0.713980
380	63939	0.739366
390	61486	0.763778
400	60046	0.787619
410	57484	0.810442
420	51412	0.830854
430	45977	0.849109
440	42082	0.865817
450	39364	0.881446
460	36152	0.895800
470	31833	0.908439
480	28459	0.919738
490	25317	0.929790
500	22396	0.938682
510	20062	0.946647
520	17513	0.953600
530	15192	0.959632
540	13581	0.965024
550	11703	0.969671
560	10021	0.973649
570	9137	0.977277
580	7802	0.980375
590	6680	0.983027
600	5795	0.985328
610	5118	0.987360
620	4424	0.989116
630	3837	0.990640
640	3298	0.991949
650	2725	0.993031
660	2368	0.993971
670	2166	0.994831
680	1841	0.995562
690	1555	0.996180
700	1326	0.996706
710	1169	0.997170
720	1034	0.997581
730	820	0.997906
740	705	0.998186
750	678	0.998456
760	495	0.998652
770	463	0.998836
780	410	0.998999
790	344	0.999135
800	296	0.999253
810	257	0.999355
820	217	0.999441
830	185	0.999514
840	155	0.999576
850	140	0.999632
860	121	0.999680
870	88	0.999715
880	96	0.999753
890	86	0.999787
900	70	0.999815
910	48	0.999834
920	49	0.999853
930	46	0.999871
940	29	0.999883
950	24	0.999892
960	19	0.999900
970	16	0.999906
980	24	0.999916
990	12	0.999921
1000	7	0.999923
1010	16	0.999930
1020	14	0.999935
1030	7	0.999938
1040	10	0.999942
1050	5	0.999944
1060	9	0.999948
1070	6	0.999950
1080	3	0.999951
1090	5	0.999953
1100	2	0.999954
1110	3	0.999955
1140	2	0.999956
1160	1	0.999956
1200	1	0.999957
1210	1	0.999957
1300	1	0.999958
1310	2	0.999958
1320	1	0.999959
1340	2	0.999960
1350	3	0.999961
1390	1	0.999961
2510	1	0.999961
2530	1	0.999962
3430	2	0.999963
3470	1	0.999963
3480	1	0.999963
3530	1	0.999964
3570	1	0.999964
3640	1	0.999965
3650	1	0.999965
3670	2	0.999966
3740	1	0.999966
3750	1	0.999967
3780	1	0.999967
3820	1	0.999967
3830	1	0.999968
4080	1	0.999968
4250	1	0.999969
4260	4	0.999970
4270	6	0.999973
4280	4	0.999974
4290	3	0.999975
4300	2	0.999976
4310	4	0.999978
4320	2	0.999979
4460	1	0.999979
4470	1	0.999979
4480	1	0.999980
4490	1	0.999980
4500	1	0.999981
4520	1	0.999981
4540	1	0.999981
4560	1	0.999982
4600	1	0.999982
4680	1	0.999983
5480	1	0.999983
5510	1	0.999983
5520	1	0.999984
5540	1	0.999984
5550	1	0.999985
5560	3	0.999986
5570	3	0.999987
5580	2	0.999988
5590	1	0.999988
5600	1	0.999988
5640	1	0.999989
5650	1	0.999989
5700	1	0.999990
5720	2	0.999990
5730	1	0.999991
5770	1	0.999991
5890	1	0.999992
7180	1	0.999992
7620	1	0.999992
8720	1	0.999993
8780	1	0.999993
9110	1	0.999994
9130	1	0.999994
9480	1	0.999994
10560	1	0.999995
10610	1	0.999995
10770	1	0.999996
11910	1	0.999996
12280	1	0.999996
12570	1	0.999997
13590	1	0.999997
13760	1	0.999998
14190	1	0.999998
14790	1	0.999998
15210	1	0.999999
15800	1	0.999999
17080	1	1.000000
17570	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	112	0	9.200	35	0.00139%
1	0	9478	119	175.727	1386120	55.03405%
2	0	17569	263	866.184	512	0.02033%
3	0	4592	245	365.973	548641	21.78306%
8	0	3	1	1.375	8	0.00032%
9	0	833	119	170.281	583382	23.16241%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 75149.828125(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 8589343, 3.410284
[cache hit cnt,ratio dftl] 8589343, 0.892943
[READ WRITE CNT] 2518659 7100480
error cnt:125
result of ms:
---
bye bye!
# of gc: 9
# of translation page gc: 9
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 721878
# of buf hit: 4
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 1969518
Cache miss on read: 549153
Cache hit on write: 6619825
Cache miss on write: 138575

Clean hit on read: 1551270
Dirty hit on read: 447324
Clean hit on write: 35174
Dirty hit on write: 6584651

% of miss : 0.07
# Clean eviction: 548641
# Dirty eviction: 173237

Clean eviciton on read: 548641
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 173237

Dirty eviction ratio: 24.00%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.07

0 9
1 684827
2 173237
3 683
4 683
5 2518655
6 6758400
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:57173	read_q_hit:0	retry_hit:0